Josiah-crown/cool-breeze-nexus/hardware/esp32/ARCHIVED/ESP32_Cirrus_12V_V2/ESP32_Cirrus_12V_V2.ino
/*
 * ============================================
 * ESP32 - Cirrus Machine (12V Logic)
 * Cool Breeze Nexus Integration
 * ============================================
 * 
 * VERSION: 2.1.0 (Dashboard Compatible)
 * COMPATIBILITY: ESP32 Arduino Core 2.0.11 - 3.0.x
 * 
 * DIFFERENCES FROM EVAPORATIVE COOLER VERSION:
 * - 12V pickup logic (instead of 24V)
 * - Non-inverted fan speed (lower voltage = lower speed)
 * - Same voltage dividers as 24V version
 * - CT sensor unchanged
 * 
 * FEATURES:
 * - WiFiManager for easy WiFi configuration
 * - Supabase HTTP POST integration (Dashboard Compatible)
 * - WiFi/ADC conflict resolution (WiFi OFF during sensor reading)
 * - 1-minute averaged sensor readings
 * - Timeout mechanisms for slow/failed connections
 * - Automatic 6-month full reset (memory leak prevention)
 * - Daily soft reset (24-hour power cycle)
 * - RTC memory for persistent uptime tracking
 * - Smart status detection (good/warning/error)
 * 
 * TIMING:
 * - Sensor readings: Every 1 second (WiFi OFF)
 * - Data transmission: Every 60 seconds (WiFi ON briefly)
 * - WiFi timeout: 30 seconds for connection
 * - HTTP timeout: 60 seconds for POST
 * - Max WiFi on time: 120 seconds (safety net)
 * 
 * ============================================
 */

#include <WiFi.h>
#include <WiFiManager.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <Preferences.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <esp_task_wdt.h>
#include <EmonLib.h>
#include <esp_adc_cal.h>
#include <time.h>
#include <esp_system.h>
#include <ArduinoJson.h>

// ============================================
// DEBUG MODE - Set to 1 for detailed sensor output
// ============================================
#define DEBUG_MODE 1  // Change to 0 to disable debug output

// ============================================
// DEVICE CONFIGURATION
// ============================================
const String DEVICE_ID = "CIRRUS";
const String FIRMWARE_VERSION = "2.1.0-12V";

// ============================================
// TIMING CONSTANTS
// ============================================
const unsigned long SENSOR_READ_INTERVAL = 1000;      // 1 second
const unsigned long DATA_SEND_INTERVAL = 30000;       // 30 seconds (faster updates)
const unsigned long WIFI_CONNECT_TIMEOUT = 30000;     // 30 seconds
const unsigned long HTTP_POST_TIMEOUT = 8000;         // 8 seconds (before watchdog)
const unsigned long MAX_WIFI_ON_TIME = 120000;        // 2 minutes (safety net)
const unsigned long DAILY_RESET_INTERVAL = 86400000;  // 24 hours
const unsigned long SIX_MONTH_RESET = 15552000000ULL; // 180 days in milliseconds

// ============================================
// Pin Definitions
// ============================================
const int TEMP_PIN_MOTOR = 21;
const int TEMP_PIN_EXTERIOR = 22;
const int TEMP_PIN_INTERIOR = 23;
const int CT_PIN = 36;
const int FLOAT_PIN = 5;
const int GPIO_YELLOW_EXHAUST = 34;
const int GPIO_GREEN_FAN = 35;
const int GPIO_BROWN_PUMP = 32;
const int GPIO_BLACK_DRAIN = 33;

// ============================================
// Temperature Sensor Setup
// ============================================
OneWire oneWireMotor(TEMP_PIN_MOTOR);
OneWire oneWireExterior(TEMP_PIN_EXTERIOR);
OneWire oneWireInterior(TEMP_PIN_INTERIOR);

DallasTemperature sensorMotor(&oneWireMotor);
DallasTemperature sensorExterior(&oneWireExterior);
DallasTemperature sensorInterior(&oneWireInterior);

// ============================================
// CT Sensor Configuration (UNCHANGED)
// ============================================
EnergyMonitor emon1;
const float CALIBRATION = 16.5;
const float MIN_CURRENT_THRESHOLD = 1.0;
const float MAX_CURRENT_THRESHOLD = 16.0;
const float LINE_VOLTAGE = 230.0;
const float ADC_VREF = 3.3;

// ============================================
// Pickup ADC Configuration
// ============================================
const int ADC_SAMPLES = 100;
const int ADC_SAMPLE_DELAY_US = 150;
esp_adc_cal_characteristics_t adc_chars;

// ============================================
// 12V LOGIC - Pickup voltage thresholds
// ============================================
// NOTE: These are scaled for 12V logic with same voltage dividers
// Adjust these values based on actual measurements!
const float VOLTAGE_DISCONNECTED_MAX = 0.3;   // Reduced from 0.5 (12V vs 24V)
const float VOLTAGE_ON_MIN = 0.4;             // Reduced from 0.8
const float VOLTAGE_ON_MAX = 1.3;             // Reduced from 2.632
const float VOLTAGE_OFF_MIN = 1.4;            // Reduced from 2.807

// ============================================
// NON-INVERTED Fan speed calculation (GREEN wire)
// Lower voltage = Lower speed (CORRECTED)
// ============================================
const float FAN_VOLTAGE_0_SPEED = 0.5;        // Low voltage = 0% speed
const float FAN_VOLTAGE_100_SPEED = 1.0;      // High voltage = 100% speed

// Moving average filter (3 readings per pickup)
const int FILTER_SIZE = 3;
float yellowFilter[FILTER_SIZE] = {0};
float greenFilter[FILTER_SIZE] = {0};
float brownFilter[FILTER_SIZE] = {0};
float blackFilter[FILTER_SIZE] = {0};
int filterIndex = 0;

// ============================================
// WiFi & Supabase Configuration
// ============================================
WiFiManager wifiManager;
Preferences preferences;

// HARDCODED Supabase credentials (same for all devices)
const char* SUPABASE_URL = "https://wjyanxstvbiqefmgpccb.supabase.co";
// Supabase credentials should be provisioned per device (do not hardcode secrets in firmware)
const char* SUPABASE_ANON_KEY = "";

// Per-device configuration (entered during setup)
String supabaseUrl = "";
String supabaseAnonKey = "";
String machineUUID = "";
String machineAPIKey = "";  // Separate API key for machine authentication

// WiFi state tracking
bool wifiEnabled = false;
unsigned long wifiOnStartTime = 0;

// ============================================
// Data Accumulation for Averaging
// ============================================
struct SensorAccumulator {
  float tempMotorSum;
  float tempExteriorSum;
  float tempInteriorSum;
  float ctCurrentSum;
  float ctVoltageSum;
  float apparentPowerSum;
  float yellowVoltageSum;
  float greenVoltageSum;
  float brownVoltageSum;
  float blackVoltageSum;
  int tankFullCount;
  int sampleCount;
  
  // Most recent pickup statuses (not averaged)
  String yellowStatus;
  String greenStatus;
  String brownStatus;
  String blackStatus;
  int fanSpeed;
  
