Josiah-crown/cool-breeze-nexus/hardware/esp32/ARCHIVED/ESP32_Cirrus_12V_V2/ESP32_Cirrus_12V_V2.ino
  void reset() {
    tempMotorSum = 0;
    tempExteriorSum = 0;
    tempInteriorSum = 0;
    ctCurrentSum = 0;
    ctVoltageSum = 0;
    apparentPowerSum = 0;
    yellowVoltageSum = 0;
    greenVoltageSum = 0;
    brownVoltageSum = 0;
    blackVoltageSum = 0;
    tankFullCount = 0;
    sampleCount = 0;
  }
  
  void addSample(float tMotor, float tExterior, float tInterior,
                 float ctCurr, float ctVolt, float appPower,
                 float yVolt, float gVolt, float bVolt, float blVolt,
                 bool tankFull, String yStatus, String gStatus, 
                 String bStatus, String blStatus, int fSpeed) {
    tempMotorSum += tMotor;
    tempExteriorSum += tExterior;
    tempInteriorSum += tInterior;
    ctCurrentSum += ctCurr;
    ctVoltageSum += ctVolt;
    apparentPowerSum += appPower;
    yellowVoltageSum += yVolt;
    greenVoltageSum += gVolt;
    brownVoltageSum += bVolt;
    blackVoltageSum += blVolt;
    if(tankFull) tankFullCount++;
    sampleCount++;
    
    // Store most recent statuses
    yellowStatus = yStatus;
    greenStatus = gStatus;
    brownStatus = bStatus;
    blackStatus = blStatus;
    fanSpeed = fSpeed;
  }
} accumulator;

// ============================================
// RTC Memory for Uptime Tracking
// ============================================
RTC_DATA_ATTR unsigned long totalUptimeSeconds = 0;
RTC_DATA_ATTR unsigned long lastResetTime = 0;
RTC_DATA_ATTR bool rtcInitialized = false;

// ============================================
// Timing Variables
// ============================================
unsigned long lastSensorRead = 0;
unsigned long lastDataSend = 0;
unsigned long lastDailyReset = 0;
unsigned long bootTime = 0;

// ============================================
// State Machine
// ============================================
enum SystemState {
  STATE_SENSOR_READING,
  STATE_WIFI_CONNECT,
  STATE_DATA_SEND,
  STATE_WIFI_DISCONNECT
};
SystemState currentState = STATE_SENSOR_READING;

// ============================================
// SETUP
// ============================================
void setup() {
  Serial.begin(115200);
  delay(2000);
  
  Serial.println("\n\n========================================");
  Serial.println("  ESP32 - Cirrus Machine (12V Logic)");
  Serial.println("  Firmware: " + FIRMWARE_VERSION);
  Serial.println("========================================");
  Serial.println("Device ID: " + DEVICE_ID);
  Serial.println("Logic: 12V (Non-inverted fan speed)");
  
  // Initialize RTC memory tracking
  if(!rtcInitialized) {
    totalUptimeSeconds = 0;
    lastResetTime = 0;
    rtcInitialized = true;
    Serial.println("✓ RTC memory initialized");
  } else {
    Serial.print("✓ Total uptime: ");
    Serial.print(totalUptimeSeconds / 86400);
    Serial.println(" days");
  }
  
  bootTime = millis();
  lastDailyReset = bootTime;
  
  // Check if 6-month reset is needed
  unsigned long uptimeMillis = totalUptimeSeconds * 1000ULL;
  if(uptimeMillis >= SIX_MONTH_RESET) {
    Serial.println("⚠ 6-month uptime reached - performing full reset...");
    delay(1000);
    
    // Clear all persistent data EXCEPT WiFi credentials
    preferences.begin("iot-nexus", false);
    preferences.clear();
    preferences.end();
    
    // Reset RTC memory
    totalUptimeSeconds = 0;
    lastResetTime = 0;
    
    // Reboot
    ESP.restart();
  }
  
  // Initialize preferences (for Supabase config)
  preferences.begin("iot-nexus", false);
  
  // Configure WiFiManager
  wifiManager.setConfigPortalTimeout(180); // 3 minutes for configuration
  wifiManager.setSaveConfigCallback(saveConfigCallback);
  
  // Add custom parameters ONLY for machine-specific info
  // (Supabase URL and Anon Key are hardcoded - same for all devices!)
  WiFiManagerParameter customMachineUUID("machine_uuid", "Machine UUID (from Dashboard)", "", 40);
  WiFiManagerParameter customMachineAPIKey("api_key", "Machine API Key (from Dashboard)", "", 100);
  
  wifiManager.addParameter(&customMachineUUID);
  wifiManager.addParameter(&customMachineAPIKey);
  
  Serial.println("\n========================================");
  Serial.println("WiFi Configuration:");
  Serial.println("========================================");
  
  // Load hardcoded Supabase credentials (same for all devices)
  supabaseUrl = String(SUPABASE_URL);
  supabaseAnonKey = String(SUPABASE_ANON_KEY);
  Serial.println("✓ Using hardcoded Supabase credentials");
  
  // Try to load saved machine-specific config
  machineUUID = preferences.getString("machine_uuid", "");
  machineAPIKey = preferences.getString("api_key", "");
  
  if(machineUUID.length() > 0 && machineAPIKey.length() > 0) {
    Serial.println("✓ Machine config loaded from memory");
    Serial.print("  Supabase URL: ");
    Serial.println(supabaseUrl);
    Serial.print("  Machine UUID: ");
    Serial.println(machineUUID);
    Serial.println("  API Key: Configured ✓");
    
    // WiFi is OFF by default - we'll connect when needed
    WiFi.mode(WIFI_OFF);
    wifiEnabled = false;
    Serial.println("✓ WiFi currently disabled (will enable for data transmission)");
  } else {
    // No config present – force setup portal immediately
    Serial.println("⚠ No machine config found - LAUNCHING CONFIG PORTAL NOW!");
    Serial.println("========================================");
    
    launchConfigPortal();

    // Reload saved values after portal closes
    machineUUID = preferences.getString("machine_uuid", "");
    machineAPIKey = preferences.getString("api_key", "");

    Serial.println("✓ Configuration complete!");
    Serial.print("  Supabase URL: ");
    Serial.println(supabaseUrl);
    Serial.print("  Machine UUID: ");
    Serial.println(machineUUID);
    Serial.print("  Machine API Key: ");
    Serial.println(machineAPIKey.length() > 0 ? "Set ✓" : "MISSING ⚠");

    wifiEnabled = true;  // WiFi is connected via portal
  }

  Serial.println("========================================\n");
  
  // Initialize hardware
  initializeHardware();
  
  // Initialize watchdog timer (10 seconds)
  // Compatible with both ESP32 core 2.x and 3.x
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    // ESP32 core 3.x - new API with config struct
    esp_task_wdt_config_t twdt_config = {
      .timeout_ms = 10000,  // 10 seconds
      .idle_core_mask = (1 << portNUM_PROCESSORS) - 1,
      .trigger_panic = true
    };
    esp_task_wdt_init(&twdt_config);
    esp_task_wdt_add(NULL);
  #else
    // ESP32 core 2.x - old API
    esp_task_wdt_init(10, true);
    esp_task_wdt_add(NULL);
  #endif
  
  Serial.println("✓ Setup complete. Starting sensor readings...\n");
  Serial.println("OPERATION MODE:");
  Serial.println("  - Sensor readings: Every 1 second (WiFi OFF)");
  Serial.println("  - Data transmission: Every 60 seconds (WiFi ON briefly)");
  Serial.println("  - Daily reset: Every 24 hours");
  Serial.println("  - Full reset: Every 6 months");
  
  #if DEBUG_MODE
    Serial.println("\n⚠ DEBUG MODE ENABLED ⚠");
    Serial.println("  Detailed sensor output every reading");
    Serial.println("  To disable: Set DEBUG_MODE to 0 at top of code");
  #else
    Serial.println("\n✓ Production Mode");
    Serial.println("  Brief status every 10 readings");
  #endif
  
  Serial.println("========================================\n");
  
  // Reset accumulator
  accumulator.reset();
}

