Josiah-crown/cool-breeze-nexus/hardware/esp32/ARCHIVED/ESP32_Cirrus_12V_V2/ESP32_Cirrus_12V_V2.ino
// ============================================
// Initialize Hardware
// ============================================
void initializeHardware() {
  Serial.println("Initializing hardware...");
  
  // ADC configuration
  analogSetAttenuation(ADC_11db);
  analogSetWidth(12);
  esp_adc_cal_characterize(ADC_UNIT_1, ADC_ATTEN_DB_11, ADC_WIDTH_BIT_12, 1100, &adc_chars);
  
  // CT sensor
  pinMode(CT_PIN, INPUT);
  emon1.current(CT_PIN, CALIBRATION);
  Serial.println("✓ CT sensor initialized on GPIO 36");
  
  // Temperature sensors
  sensorMotor.begin();
  sensorExterior.begin();
  sensorInterior.begin();
  Serial.println("✓ Temperature sensors initialized (GPIOs 21, 22, 23)");
  
  // Float switch
  pinMode(FLOAT_PIN, INPUT_PULLUP);
  Serial.println("✓ Float switch initialized on GPIO 5");
  
  // Pickup inputs
  pinMode(GPIO_YELLOW_EXHAUST, INPUT);
  pinMode(GPIO_GREEN_FAN, INPUT);
  pinMode(GPIO_BROWN_PUMP, INPUT);
  pinMode(GPIO_BLACK_DRAIN, INPUT);
  Serial.println("✓ Pickup inputs initialized (GPIOs 34, 35, 32, 33)");
  Serial.println("✓ 12V logic thresholds configured");
}

// ============================================
// MAIN LOOP - State Machine
// ============================================
void loop() {
  unsigned long currentMillis = millis();
  
  // Feed watchdog
  esp_task_wdt_reset();
  
  // Check for daily reset (24 hours)
  if(currentMillis - lastDailyReset >= DAILY_RESET_INTERVAL) {
    performDailyReset();
  }
  
  // Update RTC uptime counter every second
  static unsigned long lastUptimeUpdate = 0;
  if(currentMillis - lastUptimeUpdate >= 1000) {
    totalUptimeSeconds++;
    lastUptimeUpdate = currentMillis;
  }
  
  // CRITICAL: Safety net - force WiFi off if on too long
  checkWiFiTimeout();
  
  // State machine execution
  switch(currentState) {
    case STATE_SENSOR_READING:
      stateSensorReading(currentMillis);
      break;
      
    case STATE_WIFI_CONNECT:
      stateWiFiConnect(currentMillis);
      break;
      
    case STATE_DATA_SEND:
      stateDataSend(currentMillis);
      break;
      
    case STATE_WIFI_DISCONNECT:
      stateWiFiDisconnect(currentMillis);
      break;
  }
  
  delay(10); // Small delay to prevent tight looping
}

// ============================================
// STATE: Sensor Reading (WiFi OFF)
// ============================================
void stateSensorReading(unsigned long currentMillis) {
  // Read sensors every second
  if(currentMillis - lastSensorRead >= SENSOR_READ_INTERVAL) {
    // CRITICAL: Ensure WiFi is OFF before reading
    if(wifiEnabled) {
      Serial.println("⚠ WARNING: WiFi still on during sensor read - disabling...");
      disableWiFi();
    }
    
    // Read all sensors
    float tMotor = readTemperature(sensorMotor);
    float tExterior = readTemperature(sensorExterior);
    float tInterior = readTemperature(sensorInterior);
    
    float ctCurrent, ctVoltage, apparentPower;
    readCTSensor(ctCurrent, ctVoltage, apparentPower);
    
    bool tankFull = (digitalRead(FLOAT_PIN) == LOW);
    
    float yVolt, gVolt, bVolt, blVolt;
    String yStatus, gStatus, bStatus, blStatus;
    int fanSpeed;
    readPickups(yVolt, gVolt, bVolt, blVolt, yStatus, gStatus, bStatus, blStatus, fanSpeed);
    
    // Accumulate samples
    accumulator.addSample(tMotor, tExterior, tInterior, ctCurrent, ctVoltage, 
                          apparentPower, yVolt, gVolt, bVolt, blVolt, tankFull,
                          yStatus, gStatus, bStatus, blStatus, fanSpeed);
    
    lastSensorRead = currentMillis;
    
    #if DEBUG_MODE
      // DETAILED DEBUG OUTPUT - Shows all sensor readings
      Serial.println("\n┌─────────────────────────────────────────────────────");
      Serial.print("│ Sample: ");
      Serial.print(accumulator.sampleCount);
      Serial.print("/60  |  Uptime: ");
      Serial.print(millis() / 1000);
      Serial.println(" seconds");
      Serial.println("├─────────────────────────────────────────────────────");
      
      // Temperature Sensors
      Serial.println("│ TEMPERATURE SENSORS:");
      Serial.print("│   Motor:    ");
      Serial.print(tMotor, 2);
      Serial.print(" °C");
      if(tMotor == -999.0) Serial.print(" ⚠ ERROR!");
      Serial.println();
      
      Serial.print("│   Exterior: ");
      Serial.print(tExterior, 2);
      Serial.print(" °C");
      if(tExterior == -999.0) Serial.print(" ⚠ ERROR!");
      Serial.println();
      
      Serial.print("│   Interior: ");
      Serial.print(tInterior, 2);
      Serial.print(" °C");
      if(tInterior == -999.0) Serial.print(" ⚠ ERROR!");
      Serial.println();
      
      // CT Sensor
      Serial.println("│");
      Serial.println("│ CURRENT TRANSFORMER:");
      Serial.print("│   Current:  ");
      Serial.print(ctCurrent, 2);
      Serial.println(" A");
      Serial.print("│   Voltage:  ");
      Serial.print(ctVoltage, 3);
      Serial.println(" V (ADC)");
      Serial.print("│   Power:    ");
      Serial.print(apparentPower, 1);
      Serial.println(" VA");
      
      // Float Switch
      Serial.println("│");
      Serial.println("│ FLOAT SWITCH:");
      Serial.print("│   Tank: ");
      Serial.println(tankFull ? "FULL ✓" : "EMPTY");
      
      // Pickup Inputs (12V LOGIC)
      Serial.println("│");
      Serial.println("│ PICKUP INPUTS (12V Logic):");
      
      // Yellow (Exhaust)
      Serial.print("│   GPIO 34 Yellow: ");
      Serial.print(yVolt, 3);
      Serial.print(" V  →  ");
      Serial.print(yStatus);
      if(yStatus == "DISCONNECTED") Serial.print(" ⚠");
      Serial.println();
      
      // Green (Fan + Speed - NON-INVERTED)
      Serial.print("│   GPIO 35 Green:  ");
      Serial.print(gVolt, 3);
      Serial.print(" V  →  ");
      Serial.print(gStatus);
      if(gStatus == "ON") {
        Serial.print("  (Fan Speed: ");
        Serial.print(fanSpeed);
        Serial.print("% - Non-inverted)");
      }
      if(gStatus == "DISCONNECTED") Serial.print(" ⚠");
      Serial.println();
      
      // Brown (Pump)
      Serial.print("│   GPIO 32 Brown:  ");
      Serial.print(bVolt, 3);
      Serial.print(" V  →  ");
      Serial.print(bStatus);
      if(bStatus == "DISCONNECTED") Serial.print(" ⚠");
      Serial.println();
      
      // Black (Drain)
      Serial.print("│   GPIO 33 Black:  ");
      Serial.print(blVolt, 3);
      Serial.print(" V  →  ");
      Serial.print(blStatus);
      if(blStatus == "DISCONNECTED") Serial.print(" ⚠");
      Serial.println();
      
      Serial.println("└─────────────────────────────────────────────────────");
      
    #else
      // BRIEF OUTPUT (Production Mode)
      // Print brief status every 10 samples
      if(accumulator.sampleCount % 10 == 0) {
        Serial.print("📊 Samples: ");
        Serial.print(accumulator.sampleCount);
        Serial.print("/60  |  Temp Motor: ");
        Serial.print(tMotor, 1);
        Serial.print("°C  |  CT: ");
        Serial.print(ctCurrent, 2);
        Serial.println("A");
      }
    #endif
  }
  
  // Check if it's time to send data (every 60 seconds)
  if(currentMillis - lastDataSend >= DATA_SEND_INTERVAL) {
    if(accumulator.sampleCount > 0) {
      Serial.println("\n⏱ 60 seconds elapsed - transitioning to WiFi connect...");
      currentState = STATE_WIFI_CONNECT;
    } else {
      Serial.println("⚠ No samples collected - skipping transmission");
      lastDataSend = currentMillis;
    }
  }
}

