Josiah-crown/cool-breeze-nexus/hardware/esp32/ARCHIVED/ESP32_Cirrus_12V_V2/ESP32_Cirrus_12V_V2.ino
// ============================================
// STATE: WiFi Connect
// ============================================
void stateWiFiConnect(unsigned long currentMillis) {
  Serial.println("\n========================================");
  Serial.println("  WIFI CONNECT STATE");
  Serial.println("========================================");
  
  enableWiFi();
  
  // Try to connect with timeout
  unsigned long connectStart = millis();
  bool connected = false;
  
  // First, try autoConnect (uses saved credentials)
  Serial.println("Attempting to connect to saved WiFi network...");
  
  WiFi.mode(WIFI_STA);
  WiFi.begin(); // Use saved credentials
  
  while(millis() - connectStart < WIFI_CONNECT_TIMEOUT) {
    if(WiFi.status() == WL_CONNECTED) {
      connected = true;
      break;
    }
    Serial.print(".");
    delay(500);
    esp_task_wdt_reset(); // Feed watchdog during connection
  }
  
  Serial.println();
  
  if(connected) {
    Serial.println("✓ WiFi connected!");
    Serial.print("  IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("  RSSI: ");
    Serial.print(WiFi.RSSI());
    Serial.println(" dBm");
    
    // Sync time with NTP
    configTime(0, 0, "pool.ntp.org");
    
    currentState = STATE_DATA_SEND;
  } else {
    Serial.println("✗ WiFi connection failed (timeout)");
    Serial.println("  Discarding accumulated data to prevent overflow");
    
    // CRITICAL: Discard data during long outages
    accumulator.reset();
    lastDataSend = millis();
    
    currentState = STATE_WIFI_DISCONNECT;
  }
}

// ============================================
// STATE: Data Send
// ============================================
void stateDataSend(unsigned long currentMillis) {
  Serial.println("\n========================================");
  Serial.println("  DATA SEND STATE");
  Serial.println("========================================");
  
  // Check if Supabase is configured
  if(supabaseUrl.length() == 0 || machineUUID.length() == 0 || machineAPIKey.length() == 0) {
    Serial.println("⚠ Supabase not fully configured - launching config portal...");
    Serial.println("  Missing:");
    if(supabaseUrl.length() == 0) Serial.println("    - Supabase URL");
    if(machineUUID.length() == 0) Serial.println("    - Machine UUID");
    if(machineAPIKey.length() == 0) Serial.println("    - Machine API Key");
    launchConfigPortal();
    currentState = STATE_WIFI_DISCONNECT;
    return;
  }
  
  // Calculate averages
  float avgTempMotor = accumulator.tempMotorSum / accumulator.sampleCount;
  float avgTempExterior = accumulator.tempExteriorSum / accumulator.sampleCount;
  float avgTempInterior = accumulator.tempInteriorSum / accumulator.sampleCount;
  float avgCtCurrent = accumulator.ctCurrentSum / accumulator.sampleCount;
  float avgCtVoltage = accumulator.ctVoltageSum / accumulator.sampleCount;
  float avgApparentPower = accumulator.apparentPowerSum / accumulator.sampleCount;
  float avgYellowVoltage = accumulator.yellowVoltageSum / accumulator.sampleCount;
  float avgGreenVoltage = accumulator.greenVoltageSum / accumulator.sampleCount;
  float avgBrownVoltage = accumulator.brownVoltageSum / accumulator.sampleCount;
  float avgBlackVoltage = accumulator.blackVoltageSum / accumulator.sampleCount;
  bool tankFullAvg = (accumulator.tankFullCount > (accumulator.sampleCount / 2));
  
  // Print averaged data
  Serial.println("\nAveraged Data (from " + String(accumulator.sampleCount) + " samples):");
  Serial.println("  Temp Motor:    " + String(avgTempMotor, 2) + " °C");
  Serial.println("  Temp Exterior: " + String(avgTempExterior, 2) + " °C");
  Serial.println("  Temp Interior: " + String(avgTempInterior, 2) + " °C");
  Serial.println("  CT Current:    " + String(avgCtCurrent, 2) + " A");
  Serial.println("  Tank:          " + String(tankFullAvg ? "FULL" : "EMPTY"));
  
  // Build JSON payload
  bool success = sendToSupabase(
    avgTempMotor, avgTempExterior, avgTempInterior,
    avgCtCurrent, avgCtVoltage, avgApparentPower,
    avgYellowVoltage, avgGreenVoltage, avgBrownVoltage, avgBlackVoltage,
    tankFullAvg,
    accumulator.yellowStatus, accumulator.greenStatus,
    accumulator.brownStatus, accumulator.blackStatus,
    accumulator.fanSpeed
  );
  
  if(success) {
    Serial.println("✓ Data sent successfully!");
  } else {
    Serial.println("✗ Data send failed");
  }
  
  // Reset accumulator for next cycle
  accumulator.reset();
  lastDataSend = millis();
  
  currentState = STATE_WIFI_DISCONNECT;
}

// ============================================
// STATE: WiFi Disconnect
// ============================================
void stateWiFiDisconnect(unsigned long currentMillis) {
  Serial.println("\n========================================");
  Serial.println("  WIFI DISCONNECT STATE");
  Serial.println("========================================");
  
  disableWiFi();
  
  Serial.println("✓ WiFi disabled - returning to sensor reading");
  Serial.println("========================================\n");
  
  currentState = STATE_SENSOR_READING;
}

// ============================================
// Enable WiFi
// ============================================
void enableWiFi() {
  if(!wifiEnabled) {
    Serial.println("🔌 Enabling WiFi...");
    WiFi.mode(WIFI_STA);
    wifiEnabled = true;
    wifiOnStartTime = millis();
  }
}

// ============================================
// Disable WiFi (CRITICAL for ADC stability)
// ============================================
void disableWiFi() {
  if(wifiEnabled) {
    unsigned long wifiOnDuration = millis() - wifiOnStartTime;
    Serial.print("🔌 Disabling WiFi (was on for ");
    Serial.print(wifiOnDuration / 1000.0, 1);
    Serial.println(" seconds)");
    
    WiFi.disconnect(true);
    WiFi.mode(WIFI_OFF);
    wifiEnabled = false;
    
    // Small delay to ensure WiFi is fully off
    delay(100);
  }
}

// ============================================
// Safety Net: Force WiFi Off After Timeout
// ============================================
void checkWiFiTimeout() {
  if(wifiEnabled && (millis() - wifiOnStartTime > MAX_WIFI_ON_TIME)) {
    Serial.println("\n⚠ SAFETY NET TRIGGERED: WiFi on too long (>2 min)");
    Serial.println("  Forcing WiFi disconnect...");
    disableWiFi();
    currentState = STATE_SENSOR_READING;
  }
}

