Josiah-crown/cool-breeze-nexus/hardware/esp32/ARCHIVED/ESP32_Cirrus_12V_V2/ESP32_Cirrus_12V_V2.ino
// ============================================
// Read Temperature Sensor
// ============================================
float readTemperature(DallasTemperature &sensor) {
  sensor.requestTemperatures();
  float temp = sensor.getTempCByIndex(0);
  
  // Validate reading
  if(temp == DEVICE_DISCONNECTED_C || temp < -50 || temp > 125) {
    return -999.0; // Error value
  }
  
  return temp;
}

// ============================================
// Read CT Sensor
// ============================================
void readCTSensor(float &current, float &voltage, float &power) {
  int adcValue = analogRead(CT_PIN);
  voltage = (adcValue / 4095.0) * ADC_VREF;
  
  double irms = emon1.calcIrms(1480);
  current = irms;
  
  if(current < MIN_CURRENT_THRESHOLD) {
    current = 0.0;
  } else {
    current = constrain(current, 0, MAX_CURRENT_THRESHOLD);
  }
  
  power = current * LINE_VOLTAGE;
}

// ============================================
// Read Pickup Inputs
// ============================================
void readPickups(float &yVolt, float &gVolt, float &bVolt, float &blVolt,
                 String &yStatus, String &gStatus, String &bStatus, String &blStatus,
                 int &fanSpeed) {
  yVolt = readStableVoltage(GPIO_YELLOW_EXHAUST, yellowFilter);
  gVolt = readStableVoltage(GPIO_GREEN_FAN, greenFilter);
  bVolt = readStableVoltage(GPIO_BROWN_PUMP, brownFilter);
  blVolt = readStableVoltage(GPIO_BLACK_DRAIN, blackFilter);
  
  filterIndex = (filterIndex + 1) % FILTER_SIZE;
  
  yStatus = getStatus(yVolt);
  gStatus = getStatus(gVolt);
  bStatus = getStatus(bVolt);
  blStatus = getStatus(blVolt);
  
  fanSpeed = calculateFanSpeed(gVolt, gStatus);
}

// ============================================
// Read Stable Voltage with Averaging
// ============================================
float readStableVoltage(int pin, float* filterArray) {
  // Discard first readings for ADC settling
  for(int i = 0; i < 10; i++) {
    analogRead(pin);
    delayMicroseconds(ADC_SAMPLE_DELAY_US);
  }
  
  // Average samples
  long sum = 0;
  for(int i = 0; i < ADC_SAMPLES; i++) {
    sum += analogRead(pin);
    delayMicroseconds(ADC_SAMPLE_DELAY_US);
  }
  
  float avgADC = sum / (float)ADC_SAMPLES;
  float voltage = (avgADC / 4095.0) * ADC_VREF;
  
  // Apply moving average filter
  filterArray[filterIndex] = voltage;
  
  float filteredSum = 0;
  for(int i = 0; i < FILTER_SIZE; i++) {
    filteredSum += filterArray[i];
  }
  
  return filteredSum / FILTER_SIZE;
}

// ============================================
// Get Pickup Status from Voltage (12V LOGIC)
// ============================================
String getStatus(float voltage) {
  if(voltage < VOLTAGE_DISCONNECTED_MAX) {
    return "DISCONNECTED";
  } else if(voltage >= VOLTAGE_ON_MIN && voltage <= VOLTAGE_ON_MAX) {
    return "ON";
  } else if(voltage >= VOLTAGE_OFF_MIN) {
    return "OFF";
  } else {
    return "UNKNOWN";
  }
}

// ============================================
// Calculate Fan Speed (NON-INVERTED for 12V)
// Lower voltage = Lower speed (CORRECTED)
// ============================================
int calculateFanSpeed(float voltage, String status) {
  if(status != "ON") {
    return 0;
  }
  
  // NON-INVERTED: Lower voltage = lower speed
  if(voltage >= FAN_VOLTAGE_0_SPEED && voltage <= FAN_VOLTAGE_100_SPEED) {
    float speedFloat = ((voltage - FAN_VOLTAGE_0_SPEED) / 
                        (FAN_VOLTAGE_100_SPEED - FAN_VOLTAGE_0_SPEED)) * 100.0;
    return constrain((int)speedFloat, 0, 100);
  } else if(voltage > FAN_VOLTAGE_100_SPEED) {
    return 100;  // Above 100% voltage = max speed
  } else {
    return 0;    // Below 0% voltage = no speed
  }
}

// ============================================
// Determine Overall Machine Status
// ============================================
String determineOverallStatus(float tMotor, float ctCurrent, bool tankFull,
                               String yStatus, String gStatus, String bStatus) {
  // CRITICAL ERRORS (Red)
  if(tMotor > 70.0) return "error";  // Motor overheating
  if(tMotor < -50.0) return "error";  // Sensor disconnected
  if(gStatus == "ON" && ctCurrent < 0.5) return "error";  // Fan on but no current (motor failure)
  if(bStatus == "ON" && !tankFull) return "error";  // Pump on but no water (will burn out pump)
  
  // WARNINGS (Orange)
  if(tMotor > 60.0) return "warning";  // Motor running hot
  if(tMotor == -999.0) return "warning";  // Sensor error
  if(yStatus == "DISCONNECTED" || gStatus == "DISCONNECTED" || 
     bStatus == "DISCONNECTED") return "warning";  // Pickup disconnected
  
  // ALL GOOD (Green)
  return "good";
}

// ============================================
// Send RAW Data to Supabase
// ============================================
// Sends only raw sensor measurements to Supabase.
// All business logic (status, delta_t, is_cooling, etc.) 
// is computed server-side for easier updates and consistency.
bool sendToSupabase(float tMotor, float tExterior, float tInterior,
                    float ctCurrent, float ctVoltage, float appPower,
                    float yVolt, float gVolt, float bVolt, float blVolt,
                    bool tankFull,
                    String yStatus, String gStatus, String bStatus, String blStatus,
                    int fanSpeed) {
  
  if(WiFi.status() != WL_CONNECTED) {
    Serial.println("✗ WiFi not connected");
    return false;
  }
  
  HTTPClient http;
  http.setTimeout(HTTP_POST_TIMEOUT);
  
  // Direct to Edge Function endpoint (secure - validates machine API key)
  String endpoint = supabaseUrl + "/functions/v1/esp32-data-receiver";
  
  // Build JSON payload - RAW SENSOR DATA ONLY
  StaticJsonDocument<768> doc;
  
  // ========================================
  // RAW SENSOR READINGS
  // ========================================
  doc["machine_id"] = machineUUID;
  
  // Temperatures (°C)
  doc["motor_temp"] = tMotor;           // Temp 1
  doc["outside_temp"] = tExterior;      // Temp 2
  doc["inside_temp"] = tInterior;       // Temp 3
  
