Josiah-crown/cool-breeze-nexus/hardware/esp32/ARCHIVED/ESP32_Cirrus_12V_V2/ESP32_Cirrus_12V_V2.ino
  // Current & Power
  doc["current"] = ctCurrent;           // Amps
  doc["voltage"] = LINE_VOLTAGE;        // 230V constant
  doc["power"] = appPower;              // Watts (V × I)
  
  // Tank Status
  doc["has_water"] = tankFull;          // Water full/empty (bool)
  
  // ========================================
  // RAW PICKUP VOLTAGES (for server-side logic)
  // ========================================
  doc["exhaust_voltage"] = yVolt;       // Voltage 1 (Yellow wire)
  doc["fan_voltage"] = gVolt;           // Voltage 2 (Green wire)
  doc["pump_voltage"] = bVolt;          // Voltage 3 (Brown wire)
  doc["drain_voltage"] = blVolt;        // Voltage 4 (Black wire)
  
  String jsonString;
  serializeJson(doc, jsonString);
  
  Serial.println("\nPOST to Supabase (RAW DATA):");
  Serial.println("  URL: " + endpoint);
  Serial.println("  Machine ID: " + machineUUID);
  Serial.print("  Temps: Motor=");
  Serial.print(tMotor);
  Serial.print("°C, Out=");
  Serial.print(tExterior);
  Serial.print("°C, In=");
  Serial.print(tInterior);
  Serial.println("°C");
  Serial.print("  Current: ");
  Serial.print(ctCurrent);
  Serial.println(" A");
  
  #if DEBUG_MODE
    Serial.println("  Full Payload: " + jsonString);
  #endif
  
  // Send HTTP POST to Edge Function (validates machine API key)
  http.begin(endpoint);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("apikey", supabaseAnonKey);  // Still needed for Supabase routing
  http.addHeader("Authorization", "Bearer " + machineAPIKey);  // Machine's API key
  http.addHeader("Prefer", "return=minimal");
  
  unsigned long postStart = millis();
  int httpCode = http.POST(jsonString);
  unsigned long postDuration = millis() - postStart;
  
  Serial.print("  HTTP Code: ");
  Serial.print(httpCode);
  Serial.print("  (took ");
  Serial.print(postDuration / 1000.0, 1);
  Serial.println(" seconds)");
  
  bool success = false;
  
  if(httpCode == 201 || httpCode == 200) {
    success = true;
    Serial.println("  ✓ Success!");
  } else {
    Serial.println("  ✗ Error:");
    Serial.println("  " + http.getString());
    
    // Helpful error messages
    if(httpCode == 401) {
      Serial.println("  → Check Machine API Key - may be invalid or expired");
    } else if(httpCode == 404) {
      Serial.println("  → Check Machine UUID - may not exist in database");
    } else if(httpCode == 422) {
      Serial.println("  → Invalid JSON format or missing required fields");
    }
  }
  
  http.end();
  
  // Safety check: Disconnect if POST took too long
  if(postDuration > HTTP_POST_TIMEOUT) {
    Serial.println("⚠ POST took longer than expected - forcing disconnect");
  }
  
  return success;
}

// ============================================
// Launch WiFiManager Config Portal
// ============================================
void launchConfigPortal() {
  Serial.println("\n========================================");
  Serial.println("  CONFIGURATION PORTAL");
  Serial.println("========================================");
  Serial.println("Starting WiFiManager config portal...");
  Serial.println("Connect to WiFi network: 'ESP32_Cirrus_Setup'");
  Serial.println("Navigate to: 192.168.4.1");
  Serial.println("========================================\n");
  
  // Start config portal
  wifiManager.startConfigPortal("ESP32_Cirrus_Setup");
  
  // After config is saved
  if(WiFi.status() == WL_CONNECTED) {
    Serial.println("✓ WiFi configured and connected!");
  }
}

// ============================================
// WiFiManager Save Config Callback
// ============================================
void saveConfigCallback() {
  Serial.println("\n✓ Config saved - retrieving parameters...");
  
  // Get ONLY machine-specific parameters (Supabase credentials are hardcoded)
  machineUUID = wifiManager.server->arg("machine_uuid");
  machineAPIKey = wifiManager.server->arg("api_key");
  
  // Save ONLY machine-specific config to preferences
  preferences.putString("machine_uuid", machineUUID);
  preferences.putString("api_key", machineAPIKey);
  
  Serial.print("  Machine UUID: ");
  Serial.println(machineUUID);
  Serial.print("  Machine API Key: ");
  Serial.println(machineAPIKey.length() > 0 ? "Set ✓" : "MISSING ⚠");
  Serial.println("  Config saved to flash memory");
}

// ============================================
// Perform Daily Reset (Soft Reset)
// ============================================
void performDailyReset() {
  Serial.println("\n========================================");
  Serial.println("  DAILY RESET (24 HOURS ELAPSED)");
  Serial.println("========================================");
  Serial.println("Performing soft reset to clear RAM...");
  
  delay(1000);
  ESP.restart();
}

